update diagrams of day 3 to day 7
